Revit 2024 API
RuledFace.Point Property
Profile points of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ this[
	int index
] { get; }
Visual Basic
Public ReadOnly Property Point ( _
	index As Integer _
) As XYZ
	Get
Visual C++
public:
property XYZ^ Point[int index] {
	XYZ^ get (int index);
}
Parameters
index
Type: System.Int32
See Also
RuledFace Class
Autodesk.Revit.DB Namespace